#덧셈 삭제
3/4 #나누기 기호 연습------------------주석만 추러
2**4 #곱셈을 거듭제곱으로 수정---------수정
2^10 # 거듭제곱 다른 표기 기호---------추가
6/2 
5%%2 # 나머지 구하기
5%/%2 # 몫구하기
7/2
7%/%2

#비교연산자
3>5
3<5
3=5
3==5
3==3

var = 3
var00

3!=5 #부정기호
3<=5 # 이하
3>=5 # 이상
#논리연산자
x<- TRUE       # x변수에 TRUE 저장
y<-FALSE       # y변수에 FALSE저장
z<- TRUE
v<-FALSE
x|y            #OR 연산
y|v            #OR 연산
x&y            #AND연산
!x             #NOT 연산 x값이 참이 아니다>결과는 FALSE
!y             #NOT 연산 y값이 거짓이 아니다>결과는 TRUE

var1 = 1
var2 <-1
var1
var2
var3<-c(1,2,3,4,5)
var4<-c("정민혜",2)     #conqueterate
var5<-seq(1,10)         #연속데이터 생성하기
var6<-seq(1,10, by=2)   #등차수열 >일정 간격으로 연속 데이터 생성하기
var7<-rep(var6, times=2)  #반복하여 데이터 생성하기
var8<-rep(var6, each=2)    # 각변수에 대한 반복 데이터생성
